package yj04.part1;

public class Student {
	//学号: 1234567     ---数字(整数)
	//姓名: 单身狗                  ---字符串(字符串类型)
	//性别: 男                        ---字符(字符型)   
	//年龄: 24          ---数字
	//现金: 1314.00     ---小数(浮点型) 
	//是否单身狗: true     ---真 假(布尔类型)
	//联系方式: 11011011088   ---一串字符
	
	/*
	 * 数据类型
	 * 1.基础数据类型
	 * 2.引用数据类型
	 * */

	 public static void main(String[] args) {
//		  基础数据类型（八种）
//		 * 1.byte(字节型) 8位   范围（-128~127）1字节
		 byte min=-128;
		 byte max=127;
//		 * 2.short(短整形) 16位   范围（-2^15~2^15-1）2字节
		 short num_short=9527;
//		 * 3.int(整形)  32位    范围（-2^32~2^32-1）4字节
		 int num_int=1234567;
//		 * 4.long(长整型) 64位   范围（-2^64~2^64-1）8字节
		 long num_long=1101101108;
//		 5.6.小数类型(浮点类型)
//		  单精度类型(float)，在java中默认的浮点类型是double。精确度较低,效率较高
		 float num_pi1=3.14f;
//		  双精度类型(double)，精度较高，效率较低
		 double num_pi2=3.1415926;
//		 7.布尔类型(true或false)(真或假)
		 boolean is_true=true;
		 boolean is_false=false;
//		 8.字符类型(中文单个字符和符号占两个字节，英文和数字和英文符号占一个字节,用单引号)
		 char ch='单';
//		 引用数据类型
//		 String
		 String name="特朗普";
//		 ------------------------------综上所诉：都叫变量(存储在内存中的一个可变值)-------------------------------
		 name="习大大";
		 System.out.println(name);
	}
}
